package lesson5;

/*
Создать интерфейс Growing с единственным методом void grow()
Создать абстрактный (ключевое слово abstract) класс Plant,
 реализующий (ключевое слово implements) интерфейс Growing
Поля Plant:
    Дробное число height для высоты растения
    Дробное число width для ширины растения
Конструкторы:
    один с двумя аргументами с типами как у полей, другой - пустой
Определить реализацию метода grow() (можно начать вводить "grow" и воспользоваться генерацией кода от IDEA)
    Нет входных, выходных данных
    Выводит в консоль строку "Я расту"
 */
public class HW1 {
    public static void main(String[] args) {

    }
}
