package lesson1;

/*
1. Установить JDK
На сайте https://jdk.java.net/18/ скачать версию для вашей системы
Для windows её необходимо распаковать в любое место, предпочтительней примерно в C:/Program Files/Java/
2. Скачать и установить IntelliJ IDEA
Перейти по ссылке https://www.jetbrains.com/ru-ru/idea/download/ и скачать IDEA Community Edition
Установить программу, во время установки можно оставить все параметры по умолчанию
3. Открыть IDEA и создать новый проект
Создать новый проект Java в любом удобном месте на системе
Документация от разработчиков IDEA https://www.jetbrains.com/help/idea/new-project-wizard.html
Уделить внимание выбору SDK: с большой вероятностью IDEA сама найдет установленный JDK, но если этого не произойдет, есть 2 варианта:
    или с помощью меню выбора папки указать то место, где находится папка jdk (обычно что-то типа C:/Program Files/Java/jdk...)
    или с помощью меню Download JDK скачать 18 версию JDK от любого поставщика
4. Запустить программу
После создания проекта создать новый Java Class в папке src
Внутри того кода, который автоматически появится в файле надо добавить точку входа в программу:
поставить новую строку между фигурных скобочек, написать "psvm" и нажать Enter
Появится точка входа, между фигурных скобочек которой возможно писать код программы
Если там написать sout и нажать Enter, он поставит код для вывода в консоль
Между круглых скобок написать значение любого типа и нажать Ctrl+Shift+F10 - программа запустится
После этого программу можно запускать или с помощью зеленой стрелочки, или с помощью Shift+F10
 */
public class HW0 {
}
